URLShortener/app/models/shortened_url.rb

  def self.shorten(user, long_url)
    ShortenedUrl.create!({
      long_url: long_url,
      short_url: ShortenedUrl.random_code,
      author_id: user.id
    })
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "http://ohara.co/tawnya"], ["short_url", "oaFsSH19G39777ZiUZCVUg"], ["author_id", 122], ["created_at", "2019-03-27 23:41:05.324109"], ["updated_at", "2019-03-27 23:41:05.324109"]]