URLShortener/app/models/visit.rb

    def self.record_visit!(user, short_url)
      Visit.create!(user_id: user.id, short_url_id: short_url.id)
---
INSERT INTO "visits" ("user_id", "created_at", "updated_at", "short_url_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 136], ["created_at", "2019-03-27 23:41:05.486542"], ["updated_at", "2019-03-27 23:41:05.486542"], ["short_url_id", 55]]